read_verilog register_test.v
hierarchy -check -top register_test
proc; opt
memory; opt
fsm; opt
techmap; opt
splitnets -ports; opt
clean -purge
write_blif register_test.blif